####  Step 1 - Import required packages

In [1]:
import pandas as pd                         # Dataframe operation
import numpy as np                          # Math operations
import matplotlib.pyplot as plt             # plotting
import seaborn as sns                       #plotting

#### Step2 - Create a dataframe using a list

In [3]:
names = ['Ramesh', 'Suresh', 'Mahesh']
age=[20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  22
2  Mahesh  24

**pd.DataFrame()**

- data     : data
- index    : index or array-like
- columns : index or array-like

In [5]:
## system takes age as index, we need to zip in order to make both names and age as data
# pd.DataFrame(zip(names,age))


pd.DataFrame(names,age)

         0
20  Ramesh
22  Suresh
24  Mahesh

**Step 3 : ADD the column names**

In [7]:
names = ['Ramesh', 'Suresh', 'Mahesh']
age=[20,22,24]
idx=['A', 'B', 'C']
cols=['Names', 'Age']

pd.DataFrame(zip(names,age),index=idx,columns=cols)

    Names  Age
A  Ramesh   20
B  Suresh   22
C  Mahesh   24

**Step 4- Change the index**

In [9]:
# Create empty dataframe then add the values
names = ['Ramesh', 'Suresh', 'Mahesh']
age=[20,22,24]
cols=['Name', 'Age']

pd.DataFrame(zip(names,age),index=idx,columns=cols)

     Name  Age
A  Ramesh   20
B  Suresh   22
C  Mahesh   24

**Step 5 : Create Empty dataframe and update the data frame**

    - Create empty data frame then we will add values

In [11]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [12]:
names=['Ramesh', 'Suresh', 'Sathish']
df['Names'] = names
df['Age'] =[20,22,24]
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [13]:
df['Age']

0    20
1    22
2    24
Name: Age, dtype: int64

In [14]:
df['Age'] =[30,32,34]  # update
df['City'] = ['Hyd', 'Blr', 'Chennai']  # Create
df['age']=[100,200,300]  # Create
df

# python is case sensitive - 
# Age  'age' are diffrent
# Update column values always should be len dataframe.

     Names  Age     City  age
0   Ramesh   30      Hyd  100
1   Suresh   32      Blr  200
2  Sathish   34  Chennai  300

In [16]:
df['Age'] =[20,11]

ValueError: Length of values (2) does not match length of index (3)

**Step 6: drop the column**

- labels
- axis
- index
- columns
- inplace : 'bool' =False

In [ ]:
df.drop(2, axis=0)

In [ ]:
df

In [ ]:
df.drop(columns='age')

In [ ]:
df

In [ ]:
df.drop(index=[2])

In [ ]:
df.columns

In [ ]:
df.columns[2]

In [ ]:
df.drop('age', axis=1)

In [26]:
df
df.drop(2)       # works
df.drop(2,axis=0) # works
df.drop(2,axis=1) # fail
df.drop('age', axis=2) # works
df.drop(labels=[2])
df.drop(column=['age'])

KeyError: '[2] not found in axis'

In [ ]:
df
df.drop(labels=[2])

In [ ]:
df.drop(columns=['Age'], inplace=True)

In [ ]:
df

In [ ]:
# dataframe name df
# Assignment

df.shapre
df.size
df.column
df.isnull()
len(df)
df.info()
df.drop_duplicates
df.dtypes


Assignment -2
df.rename()

In [ ]:
df = pd.DataFrame()
df['Name'] = ['Ramesh', 'Suresh', 'Sathish']
df['Age'] = [20,22,24]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df

In [ ]:
df.drop(2)    #

In [ ]:
df.drop(2,axis=0)

In [35]:
df.drop(index=2)

    Names  Age City  age
0  Ramesh   30  Hyd  100
1  Suresh   32  Blr  200

In [37]:
df.drop([1,2])

    Names  Age City  age
0  Ramesh   30  Hyd  100

In [39]:
df.drop([1,2], axis=0)

    Names  Age City  age
0  Ramesh   30  Hyd  100

In [41]:
df.drop(index=[1,2])

    Names  Age City  age
0  Ramesh   30  Hyd  100

In [43]:
df

     Names  Age     City  age
0   Ramesh   30      Hyd  100
1   Suresh   32      Blr  200
2  Sathish   34  Chennai  300

In [45]:
df.drop('City', axis=1)

     Names  Age  age
0   Ramesh   30  100
1   Suresh   32  200
2  Sathish   34  300

In [47]:
df.drop(['Name', 'City'], axis=1)

KeyError: "['Name'] not found in axis"

In [49]:
df.drop(columns = 'City')

     Names  Age  age
0   Ramesh   30  100
1   Suresh   32  200
2  Sathish   34  300

In [51]:
df.drop(columns=['Name', 'City'],axis=1)

KeyError: "['Name'] not found in axis"

In [53]:
#df.columns
dict1={'City': 'city'}
df.rename(dict1,axis=1)

     Names  Age     city  age
0   Ramesh   30      Hyd  100
1   Suresh   32      Blr  200
2  Sathish   34  Chennai  300

In [55]:
df.index
dict1={2:'b'}
df.rename(dict1)

     Names  Age     City  age
0   Ramesh   30      Hyd  100
1   Suresh   32      Blr  200
b  Sathish   34  Chennai  300

In [57]:
df.columns=['A', 'B', 'C']
df

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [59]:
df.index=['I', 'II', 'III']

In [61]:
df

       Names  Age     City  age
I     Ramesh   30      Hyd  100
II    Suresh   32      Blr  200
III  Sathish   34  Chennai  300

In [63]:
df = pd.DataFrame()
df['Name'] = ['Ramesh', 'Suresh', 'Sathish']
df['Age'] = [20,22,24]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

**Step-8 : append the rows**

- we need to use **loc**
- df.loc[<row numbers>,<column names>]
-    Example: df.loc[2,'City']

In [67]:
df.loc[2, 'City']

'Chennai'

In [69]:
df.loc[[1,2],['Name', 'City']]

      Name     City
1   Suresh      Blr
2  Sathish  Chennai

In [71]:
type(df.loc[2])

pandas.core.series.Series

In [73]:
df.loc[2]

Name    Sathish
Age          24
City    Chennai
Name: 2, dtype: object

In [144]:
df.iloc[2]

Name    Sathish
Age          24
City    Chennai
Name: 2, dtype: object

In [75]:
df.loc[[2]]

      Name  Age     City
2  Sathish   24  Chennai

In [77]:
type(df.loc[[2]])

pandas.core.frame.DataFrame

In [79]:
df.loc[[1,2]]

      Name  Age     City
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [81]:
df.loc[[1,2]]

      Name  Age     City
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [83]:
df.loc[0:3]

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [85]:
type(df.loc[0:3])

pandas.core.frame.DataFrame

In [87]:
df.loc[0:3]

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [89]:
df.loc[:]

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [91]:
df.loc[2,'City']

'Chennai'

In [93]:
df.loc[2, ['City']]

City    Chennai
Name: 2, dtype: object

In [95]:
type(df.loc[2, ['City']])

pandas.core.series.Series

In [97]:
df.loc[[2], ['City']]

      City
2  Chennai

In [99]:
type(df.loc[[2], ['City']])

pandas.core.frame.DataFrame

In [101]:
df.loc[[1,2],['Name', 'City']]

      Name     City
1   Suresh      Blr
2  Sathish  Chennai

In [103]:
df.loc[:,'City']

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

In [105]:
df.loc[:,'City']

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

In [107]:
type(df.loc[:,'City'])

pandas.core.series.Series

In [109]:
df.loc[:,['City']]

      City
0      Hyd
1      Blr
2  Chennai

## df.iloc[<rows>, <column names>]

In [112]:
df.iloc[2]

Name    Sathish
Age          24
City    Chennai
Name: 2, dtype: object

In [114]:
df.iloc[[2]]

      Name  Age     City
2  Sathish   24  Chennai

In [116]:
df.iloc[[1,2]]

      Name  Age     City
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [118]:
df.iloc[0:3]

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [120]:
df.iloc[:]

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [122]:
df.iloc[2,2]

'Chennai'

In [124]:
df.iloc[2,[2]]

City    Chennai
Name: 2, dtype: object

In [126]:
df.iloc[[2],[2]]

      City
2  Chennai

In [128]:
df.iloc[[1,2],[0,2]]

      Name     City
1   Suresh      Blr
2  Sathish  Chennai

In [130]:
df.iloc[:,[2]]

      City
0      Hyd
1      Blr
2  Chennai

In [132]:
df.iloc[:,2]

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

**Step - 9 : Save the data frame**

- where i want to save
- and what is the file name
- what is the extention .csv .xls

In [135]:
path1 = r'C:\Sravanthi\AI\employee.csv'
path2=r'employee.csv'

path3=r'C:\Sravanthi\AI\employee.xlsx'
path4=r'employee.xlsx'

df.to_csv(path1,index=False)
df.to_csv(path2,index=False)

df.to_excel(path3,index=False)
df.to_excel(path4,index=False)

In [136]:
pd.read_csv(path1)

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai

In [139]:
pd.read_excel(path3)

      Name  Age     City
0   Ramesh   20      Hyd
1   Suresh   22      Blr
2  Sathish   24  Chennai